Revit 2027 API
LightType.GetLightDistribution Method
 Return a copy of an object derived from LightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightDistribution GetLightDistribution()
Public Function GetLightDistribution As LightDistribution
public:
LightDistribution^ GetLightDistribution()
member GetLightDistribution : unit -> LightDistribution
Return Value
LightDistribution
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace